---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableColumn.GetUnitTypeId
source: html/58ff3e40-50d3-abdd-08ae-b38b03dd88a7.htm
---
# Autodesk.Revit.DB.FamilySizeTableColumn.GetUnitTypeId Method

Gets the identifier of the unit quantifying values in the column.

## Syntax (C#)
```csharp
public ForgeTypeId GetUnitTypeId()
```

## Returns
Identifier of the unit.